system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     chtMultiRegionFoam;

startFrom       latestTime;

stopAt          endTime;

//stopAt		writeNow;

endTime         15;

deltaT          0.00001;

writeControl    runTime;

writeInterval   0.0005;

purgeWrite      1000;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;

maxCo           0.6;

maxDeltaT	0.00001;

minDeltaT	0.000001;

// Maximum diffusion number
maxDi           10.0;

adjustTimeStep  yes;

functions
{
    p_rgh_residuals
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        enabled         true;
        writePrecision  12;
        writeToFile     true;
        useUserTime     true;
        region          Fluid;
        enabled         true;
        log             true;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    runTime;
        writeInterval   0.0005;
        fields
        (
            p_rgh
        );
    }

    U_residuals
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        enabled         true;
        writePrecision  12;
        writeToFile     true;
        useUserTime     true;
        region          Fluid;
        enabled         true;
        log             true;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    runTime;
        writeInterval   0.0005;
        fields
        (
            U
        );
    }

	WallHeatFlux
        {
        // Mandatory entries (unmodifiable)
        type            wallHeatFlux;
        libs            (fieldFunctionObjects.so);

        // Optional entries (runtime modifiable)
        patches     ("Fluid_to_.*"); // (wall1 "(wall2|wall3)");
        qr          qr;

        // Optional (inherited) entries
        writePrecision  12;
        writeToFile     true;
        useUserTime     true;
        region          Fluid;
        enabled         true;
        log             true;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    runTime;
        writeInterval   0.0005;
        }

	Co
        {
        // Mandatory entries (unmodifiable)
        type            CourantNo;
        libs            (fieldFunctionObjects.so);

        // Optional entries (runtime modifiable)
        rho             rho;

        // Optional (inherited) entries
        //field           <phi>;
        //result          <fieldResult>;
        region          Fluid;
        enabled         true;
        log             true;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    runTime;
        writeInterval   0.0005;
        }
}
// ************************************************************************* //
