0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
            
	    source
	    {
     		type         	zeroGradient;

	    }
            end
            {
                type            fixedValue;
                value		uniform (0 0 0);
            }

            periodicT
            {
                type            cyclic;
            }

            periodicB
            {
                type            cyclic;
            }

    	    frontend
	    {
	       type            empty;
            }

    	    backend
	    {
	       type            empty;
            }
}

// ************************************************************************* //
