0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
        {

          source
    	  {
    	     type	patch;
 	     value     uniform 1e5;  
          }

	  end
    	  {
             type	zeroGradient;
    	  }

          periodicB
          {
             type	cyclic;
          }

          periodicT
          {
             type	cyclic;
          }

          frontend
	  {
	     type	empty;
          }

    	  backend
	  {
	     type	empty;
          }
          
	}

// ************************************************************************* //
