0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
	{
    	    source
	    {	
	      	type	zeroGradient;
	      //	value	$internalField;
    	    }

    	    end
           {
               type	zeroGradient;	
           }

           periodicB
           {
              type	cyclic;
           }
           periodicT
           {
              type      cyclic;
           }

           frontend
           {
   	      type	empty;
           }

    	   backend
           {
              type	empty;
    	   }
}

// ************************************************************************* //
