system/ColdEx/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    h
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0.1;
    }

    hFinal
    {
        $h;
        tolerance        1e-06;
        relTol           0;
    }
}


PIMPLE
{
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors 3;

}
residualControl
{
    h
    {
        tolerance        1e-5;
        relTol           0;
     }
}


/*PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}*/
   

relaxationFactors
{
    equations
    {
        "h"             1;
        "hFinal"	1;
    }
}


// ************************************************************************* //
