system/Fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {

        solver                  GAMG;
        tolerance               1e-7;
        relTol                  0.01;
        smoother                GaussSeidel;
        nPreSwweeps             0;
        nPostSweeps             2;
        cacheAgglomeration      true;
        nCellsInCoarsestLevel   1000;
        agglomerator            faceAreaPair;
        mergeLevels             1;
    }


    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-7;
        relTol           0;
    }

    "(U|h|k|epsilon|R)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

    "(U|h|k|epsilon|R)Final"
    {
        $U;
        tolerance        1e-7;
        relTol           0;
    }
}

PIMPLE
{
    momentumPredictor   on;
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors 3;
}
residualControl
{


    U
    {
        tolerance        1e-5;
        relTol           0;
    }

    p_rgh
    {
        tolerance        1e-4;
        relTol           0;
     }

    h
    {
        tolerance        1e-5;
        relTol           0;
     }

}


/*PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}*/
   

relaxationFactors
{
    fields
    {
       p_rgh    	1;
       p_rghFinal	1;
    }
    equations
    {
        "U|h"           1;
        "(U|h)Final"	1;
    }
}

// ************************************************************************* //
