system/ColdEx/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


    T
    {
        //internalField   uniform 300;
        internalField	uniform 297;

        boundaryField
        {
   	    frontend
    	    {
        	type	empty;
    	    }

            backend
            {
        	type	empty;
           }

          "ColdEx_to_.*"
            {
		type	  	compressible::turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappaMethod     solidThermo;
                //value           uniform 300;
		value		uniform 297;
            }
        }
    }

    p
    {
	internalField   uniform 100000;

	boundaryField
	{
    	    frontend
    	    {
        	type	empty;
    	    }

    	    backend
            {
               type	empty;
            }

    	    "ColdEx_to.*"
    	    {
               type            	zeroGradient;
             //  value 		$internalField;
            }
      	}
     }

// ************************************************************************* //
